app/Controllers/CargosController.php

    public function index() // busca todos os cargos e manda para view.
    {

        $data = [
            'titulo' => 'Cargos',
            'cargos' => $this->cargoModel->findAll()
        ];
---
SELECT *
FROM `tbl_cargo`

    public function create()
    {
        $regras = [

            'cbo_codigo' => [
                'label' => 'CBO',
                'rules' => 'required|max_length[6]'
            ],
            'cbo_descricao' => [
                'label' => 'Descrição',
                'rules' => 'required|max_length[150]'
            ],
        ];

        if (! $this->validate($regras)) {
            return redirect()
                ->back()
                ->withinput()
                ->with('errors', $this->validator->getErrors());
            // se os dados forem invalidos, volta para o formulário, mantém o que o usuário digitou e manda os erros pra tela
        }

        $this->cargoModel->insert([
            'cbo_codigo' => $this->request->getPost('cbo_codigo'),
            'cbo_descricao' => $this->request->getPost('cbo_descricao'),
            // os dados foram aceitos dentro da validação, então irá inserir, pega os dados do formulário e salva no banco
        ]);
---
INSERT INTO `tbl_cargo` (`cbo_codigo`, `cbo_descricao`) VALUES ('317110', 'Programador de sistemas de informação/computador')