app/Controllers/FuncionariosController.php

SELECT `tbl_funcionario`.*, `tbl_cargo`.`cbo_codigo`, `tbl_cargo`.`cbo_descricao`
FROM `tbl_funcionario`
LEFT JOIN `tbl_cargo` ON `tbl_cargo`.`CBOID` = `tbl_funcionario`.`fun_CBOID`
SELECT `tbl_funcionario`.*, `tbl_cargo`.`cbo_codigo`, `tbl_cargo`.`cbo_descricao`
FROM `tbl_funcionario`
LEFT JOIN `tbl_cargo` ON `tbl_cargo`.`CBOID` = `tbl_funcionario`.`fun_CBOID`
WHERE `tbl_funcionario`.`fun_flg_status` = '0'
---
    public function index()
    {
        $status = $this->request->getGet('status');

        $query = $this->funcionarioModel
            ->select('tbl_funcionario.*, tbl_cargo.cbo_codigo, tbl_cargo.cbo_descricao')
            ->join('tbl_cargo', 'tbl_cargo.CBOID = tbl_funcionario.fun_CBOID', 'left');

        if ($status !== null && $status !== '') {
            $query->where('tbl_funcionario.fun_flg_status', $status);
        }

        $data = [
            'titulo' => 'Lista de funcionários',
            'funcionarios' => $query->findAll(),

SELECT *
FROM `tbl_cargo`
---
    public function new() // abrir tela de cadastro, envia o titulo e envia também a lista de cargos
    {
        $data = [
            'titulo' => 'Novo Funcionário',
            'cargos' => $this->cargoModel->findAll() //essa parte, traz todos os cargos do banco para você usar no select da view

INSERT INTO `tbl_funcionario` (`fun_codigo`, `fun_cpf`, `fun_nome_completo`, `fun_CBOID`, `fun_flg_status`, `fun_data_cadastro`, `fun_data_ultima_alteracao`) VALUES ('02', '88888888888', 'Funcionário teste 2', '8', '1', '2026-04-14 01:34:04', '2026-04-14 01:34:04')
---
            // se der erro na validação volta para o formulario, mantém os dados que foi digitado e manda os erros pra tela
        }

        $this->funcionarioModel->insert([ // aqui ele pega os valores do formulario, como fun_codigo e também grava as datas de cadastro e alteração.
            'fun_codigo' => $this->request->getPost('fun_codigo'),
            'fun_cpf' => $this->request->getPost('fun_cpf'),
            'fun_nome_completo' => $this->request->getPost('fun_nome_completo'),
            'fun_CBOID' => $this->request->getPost('fun_CBOID'),
            'fun_flg_status' => $this->request->getPost('fun_flg_status'),
            'fun_data_cadastro' => date('Y-m-d H:i:s'),
            'fun_data_ultima_alteracao' => date('Y-m-d H:i:s'),
        ]);

SELECT *
FROM `tbl_funcionario`
WHERE `tbl_funcionario`.`FuncionarioID` = '5'
SELECT *
FROM `tbl_cargo`
---
    public function edit($id)
    {

        $funcionario = $this->funcionarioModel->find($id);

        // se não existir, retorna erro 404
        if (!$funcionario) {
            throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound('Funcionário não encontrado.');
        }

        $data = [
            'titulo' => 'Editar Funcionário',
            'funcionario' => $funcionario,
            'cargos' => $this->cargoModel->findAll() // necessário para editar o cargo
        ];

SELECT *
FROM `tbl_funcionario`
WHERE `tbl_funcionario`.`FuncionarioID` = '5'
---
    public function update($id)
    {
        //verifica se o funcionário existe
        $funcionario = $this->funcionarioModel->find($id);

UPDATE `tbl_funcionario` SET `fun_codigo` = '1', `fun_cpf` = '99999999999', `fun_nome_completo` = 'Funcionário teste', `fun_CBOID` = '10', `fun_flg_status` = '0', `fun_data_ultima_alteracao` = '2026-04-14 01:33:34'
WHERE `tbl_funcionario`.`FuncionarioID` IN ('5')
---
        }


        $this->funcionarioModel->update($id, [
            'fun_codigo' => $this->request->getPost('fun_codigo'),
            'fun_cpf' => $this->request->getPost('fun_cpf'),
            'fun_nome_completo' => $this->request->getPost('fun_nome_completo'),
            'fun_CBOID' => $this->request->getPost('fun_CBOID'),
            'fun_flg_status' => $this->request->getPost('fun_flg_status'),
            'fun_data_ultima_alteracao' => date('Y-m-d H:i:s'),
        ]); // envia pro banco e muda a data da ultima alteração

SELECT *
FROM `tbl_funcionario`
WHERE `tbl_funcionario`.`FuncionarioID` = '5'
DELETE FROM `tbl_funcionario`
WHERE `FuncionarioID` IN ('5')
---
    public function delete($id)
    {
        //verifica se existe antes de excluir
        $funcionario = $this->funcionarioModel->find($id);

        if (!$funcionario) {
            throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound('Funcionário não encontrado.');
        }

        // Exclui o registro
        $this->funcionarioModel->delete($id);