app/Controllers/FuncionariosController.php

SELECT *
FROM `tbl_funcionario`
WHERE `tbl_funcionario`.`FuncionarioID` = '2'
---
    public function edit($id)
    {

        $funcionario = $this->funcionarioModel->find($id);