app/Controllers/Main.php

    public function index()
    {
        // echo "Hello world!";

        $model_usuarios = new UsuariosModel();
        $usuarios = $model_usuarios->findAll();
---
SELECT *
FROM `usuarios`